openfoam/pipeQuarter-les/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "131";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
65536
(
(-6.32403e-05 -7.74463e-09 1.00006)
(-0.000123534 5.97103e-05 1.00005)
(-0.00018098 0.000116397 1.00005)
(-0.000240855 0.00017531 1.00005)
(-0.000304699 0.000237921 1.00005)
(-0.000373761 0.00030545 1.00006)
(-0.000449417 0.000379232 1.00006)
(-0.000533233 0.000460804 1.00007)
...
)
;

boundaryField
{
    outlet
    {
        type            noSlip;
    }
    inlet
    {
        type            slip;
    }
    stator
    {
        type            inletOutlet;
        inletValue      uniform (0 0 1);
        value           nonuniform List<vector> 
1024
(
(0.00138971 -2.00709e-05 0.876788)
(0.00280311 0.00138078 0.873226)
(0.00426309 0.00282671 0.866089)
(0.00574322 0.00429105 0.855252)
(0.00725235 0.00578446 0.84056)
(0.008784 0.00730285 0.821853)
(0.0103195 0.00882995 0.799008)
(0.0118292 0.0103387 0.771974)
...
)
;
    }
    rotor
    {
        type            fixedValue;
        value           uniform (0 0 1);
    }
    hub
    {
        type            slip;
    }
    shroud
    {
        type            noSlip;
    }
}


// ************************************************************************* //
