openfoam/pipeQuarter-les/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "131";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
65536
(
0.197035
0.197035
0.197035
0.197036
0.197036
0.197036
0.197036
0.197037
...
)
;

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    stator
    {
        type            zeroGradient;
    }
    rotor
    {
        type            fixedValue;
        value           uniform 1;
    }
    hub
    {
        type            zeroGradient;
    }
    shroud
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
