openfoam/pipeQuarter-les/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "131";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
65536
(
4.73541e-06
4.73541e-06
4.73541e-06
4.73542e-06
4.73543e-06
4.73544e-06
4.73545e-06
4.73546e-06
...
)
;

boundaryField
{
    outlet
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    inlet
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    stator
    {
        type            calculated;
        value           nonuniform List<scalar> 
1024
(
3.42969e-07
3.41779e-07
3.39393e-07
3.35659e-07
3.30347e-07
3.23129e-07
3.13596e-07
3.01312e-07
...
)
;
    }
    rotor
    {
        type            calculated;
        value           uniform 9e-06;
    }
    hub
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    shroud
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
}


// ************************************************************************* //
