openfoam/pipeQuarter-les/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "131";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
65536
(
-0.0679577
-0.0678547
-0.0676852
-0.0674378
-0.0671062
-0.066684
-0.0661633
-0.0655344
...
)
;

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    stator
    {
        type            fixedValue;
        value           uniform 0;
    }
    rotor
    {
        type            zeroGradient;
    }
    hub
    {
        type            zeroGradient;
    }
    shroud
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
