openfoam/pipeQuarter-les/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceScalarField;
    location    "131";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
191488
(
-1.55851e-05
-1.55852e-05
0.00100983
-3.12051e-05
-1.55957e-05
0.00101166
-4.68473e-05
-1.56162e-05
...
)
;

boundaryField
{
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
2048
(
1.98523e-23
5.29396e-23
7.94093e-23
-1.58819e-22
1.05879e-22
-1.58819e-22
-1.58819e-22
1.58819e-22
...
)
;
    }
    stator
    {
        type            calculated;
        value           nonuniform List<scalar> 
1024
(
0.00342928
0.00342131
0.00339738
0.00335675
0.00329887
0.00322325
0.00312958
0.00301791
...
)
;
    }
    rotor
    {
        type            calculated;
        value           nonuniform List<scalar> 
1024
(
-0.000978655
-0.000980447
-0.000981645
-0.000982249
-0.00098226
-0.00098168
-0.000980511
-0.000978754
...
)
;
    }
    hub
    {
        type            calculated;
        value           nonuniform List<scalar> 
2048
(
-1.86489e-23
-5.19179e-24
3.8288e-23
8.07676e-24
0
-1.46661e-23
8.00487e-23
0
...
)
;
    }
    shroud
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
